src/Documents/УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеУведомленияОбОтпускеПоЛьготномуРецептуМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОрганизацииМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаДеятельностиМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерДокументаМДЛП</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПодтверждения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаСведенийЧерезСКЗКМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПолученыИзМДЛП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПервичныхУпаковокВоВторичной</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НомераУпаковок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерКИЗ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.НомерУпаковкиМДЛП</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоляОтВторичнойУпаковки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПодтверждения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СостоянияПодтвержденияМДЛП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПервичныхУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЛокальнойПроверкиСКЗКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПояснениеСтатусаПроверкиСКЗКМ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодBase64</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ПартииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПартииНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номинал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСерии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИнтеграцияМДЛППереопределяемый/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Вызывается при загрузке уведомления об отгрузке.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОПриемкеМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОбОтгрузке(Объект) Экспорт
	
	// _Демо
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("GTIN", ТекущаяСтрока.GTIN);
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.Количество;
	КонецЦикла;
	Для Каждого ТекущаяСТркоа Из Объект.СоставТранспортныхУпаковок Цикл
		ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("GTIN", ТекущаяСтрока.GTIN);
	КонецЦикла;
	// Конец _Демо
	
КонецПроцедуры

// Вызывается при загрузке уведомления о приемке.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОбОтгрузкеМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОПриемке(Объект) Экспорт
	
	// _Демо
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("GTIN", ТекущаяСтрока.GTIN);
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.Количество;
	КонецЦикла;
	// Конец _Демо
	
КонецПроцедуры

// Вызывается при загрузке уведомления о перемещении.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОПеремещенииМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОПеремещении(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке уведомления о выбытии проведенного через РВ или ККТ.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОРозничнойПродажеМДЛП,
//           ДокументОбъект.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП,
//           ДокументОбъект.УведомлениеОВыдачеВОтделенияМДЛП,
//           ДокументОбъект.УведомлениеОВыбытииМДЛП
//     - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОВыбытии(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке уведомления о завершении окончательной упаковки переданного через РЭ.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОЗавершенииЭтапаУпаковкиМДЛП - загружаемое уведомление.
//
Процедура ПриЗагрузкеУведомленияОЗавершенииОкончательнойУпаковки(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке данных о составе упаковки.
//
// Параметры:
//  Объект - ДокументОбъект.ЗапросСоставаУпаковкиМДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеДанныхОСоставеУпаковки(Объект) Экспорт
	
	
	
КонецПроцедуры

// Вызывается при загрузке данных о выводе.
//
// Параметры:
//  Объект - ДокументОбъект.УведомлениеОРозничнойПродажеМДЛП - загружаемый документ.
//
Процедура ПриЗагрузкеУведомленияОРозничнойПродаже(Объект) Экспорт
	
	
	
КонецПроцедуры

// Выполняет действия при изменении GTIN, номера серии, годен до.
//
// Параметры:
//  Объект - ДокументСсылка - Документ, в которой произошло событие,
//  ТекущаяСтрока - СтрокаТабличнойЧасти - строка таблицы товаров,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииПараметровНоменклатуры(Объект, ТекущаяСтрока, ПараметрыЗаполнения) Экспорт
	
	// _Демо
	//Если ЗначениеЗаполнено(ТекущаяСтрока.Номенклатура) И Не ЗначениеЗаполнено(ТекущаяСтрока.Серия) Тогда
	//	Запрос = Новый Запрос("
	//	|ВЫБРАТЬ
	//	|	Ссылка КАК Серия
	//	|ИЗ
	//	|	Справочник._ДемоСерииНоменклатуры
	//	|ГДЕ
	//	|	Владелец = &Номенклатура
	//	|	И НомерСерии = &НомерСерии
	//	|	И ГоденДо = &ГоденДо
	//	|");
	//	Запрос.УстановитьПараметр("Номенклатура", ТекущаяСтрока.Номенклатура);
	//	Запрос.УстановитьПараметр("НомерСерии", ТекущаяСтрока.НомерСерии);
	//	Запрос.УстановитьПараметр("ГоденДо", ТекущаяСтрока.ГоденДо);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		ТекущаяСтрока.Серия = Выборка.Серия;
	//	КонецЕсли;
	//КонецЕсли;
	// Конец _Демо
	
КонецПроцедуры

// Выполняет действия при изменении количества в таблице Товары.
//
// Параметры:
//  Объект - ДокументСсылка - Документ, в которой произошло событие,
//  ТекущаяСтрока - СтрокаТабличнойЧасти - строка таблицы товаров,
//  ПараметрыЗаполнения - Структура - см. функцию ИнтеграцияМДЛПКлиентСервер.ПараметрыЗаполненияТабличнойЧасти.
//
Процедура ПриИзмененииКоличества(Объект, ТекущаяСтрока, ПараметрыЗаполнения) Экспорт
	
	// _Демо
	Если ПараметрыЗаполнения.ПересчитатьКоличествоУпаковок Тогда
		ТекущаяСтрока.КоличествоУпаковок = ТекущаяСтрока.Количество;
	КонецЕсли;
	Если ПараметрыЗаполнения.ПересчитатьСумму Тогда
		ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	КонецЕсли;
	// Конец _Демо
	
КонецПроцедуры

// Заполняет реквизит "Серия" в товарной табличной части
//
// Параметры:
//  Объект - ДокументОбъект, ДанныеФормыКоллекция
//  ИмяТабличнойЧасти - Строка - Товарная табличная часть документа;
//  СтрокиКОбработке - Массив - Массив строк табличной части;
//  ПараметрыУказанияСерий - Структура - Параметры указания серий, формируется в модулях менеджеров документов.
//  Результат - Структура - см. ИнтеграцияМДЛП.ПустойРезультатЗаполненияСерий(), 
//  Нужно заполнить информацию об ошибках и результате операции.
//
Процедура ЗаполнитьСгенерироватьСерии(Объект, ИмяТабличнойЧасти, СтрокиКОбработке = Неопределено, ПараметрыУказанияСерий = Неопределено, Результат) Экспорт
	
	// _Демо
	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	Таблица = ТабличнаяЧасть.Выгрузить(СтрокиКОбработке, "НомерСтроки, Номенклатура, Серия, НомерСерии, ГоденДо");
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Таблица.Серия КАК Серия,
	|	Таблица.НомерСерии КАК НомерСерии,
	|	Таблица.ГоденДо КАК ГоденДо
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	&Таблица КАК Таблица
	|ГДЕ
	|	Таблица.Серия = ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.НомерСтроки  КАК НомерСтроки,
	|	Таблица.Номенклатура КАК Номенклатура,
	|	Серии.Ссылка         КАК Серия,
	|	Таблица.НомерСерии   КАК НомерСерии,
	|	Таблица.ГоденДо      КАК ГоденДо
	|ИЗ
	|	ТаблицаТовары КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ПартииНоменклатуры КАК Серии
	|	ПО
	|		Серии.Владелец = Таблица.Номенклатура
	|		И Серии.НомерСерии = Таблица.НомерСерии
	|		И Серии.ГоденДо = Таблица.ГоденДо
	|;
	|
	|//////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Таблица.Номенклатура КАК Владелец,
	|	Таблица.НомерСерии   КАК НомерСерии,
	|	Таблица.ГоденДо      КАК ГоденДо
	|ИЗ
	|	ТаблицаТовары КАК Таблица
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.ПартииНоменклатуры КАК Серии
	|	ПО
	|		Серии.Владелец = Таблица.Номенклатура
	|		И Серии.НомерСерии = Таблица.НомерСерии
	|		И Серии.ГоденДо = Таблица.ГоденДо
	|ГДЕ
	|	Серии.Ссылка ЕСТЬ NULL
	|");
	Запрос.УстановитьПараметр("Таблица", Таблица);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТаблицаНовыхСерий = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	ТаблицаНовыхСерий.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.ПартииНоменклатуры"));
	ТаблицаНовыхСерий.Индексы.Добавить("Владелец, НомерСерии, ГоденДо");
	Для Каждого ТекущаяСтрока Из ТаблицаНовыхСерий Цикл
		Если Не ЗначениеЗаполнено(ТекущаяСтрока.Владелец)
		 Или Не ЗначениеЗаполнено(ТекущаяСтрока.НомерСерии)
		 Или Не ЗначениеЗаполнено(ТекущаяСтрока.ГоденДо) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			ДанныеЗаполнения = Новый Структура("Владелец, НомерСерии, ГоденДо");
			ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, ТекущаяСтрока);
			НоваяСерия = Справочники.ПартииНоменклатуры.СоздатьЭлемент();
			НоваяСерия.Заполнить(ДанныеЗаполнения);
			НоваяСерия.Записать();
			ТекущаяСтрока.Серия = НоваяСерия.Ссылка;
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалось сгенерировать серию по причине: %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Результат.Ошибка,
				"Объект.Товары",
				ТекстСообщения,
				Неопределено);
		КонецПопытки;
	КонецЦикла;
	
	Выборка = РезультатЗапроса[РезультатЗапроса.ВГраница() - 1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Выборка.Номенклатура) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Колонка",, НСтр("ru = 'Номенклатура'"), Выборка.НомерСтроки, НСтр("ru = 'Товары'"));
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Результат.Ошибка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", Выборка.НомерСтроки, "Номенклатура"),
				ТекстСообщения,
				Неопределено);
			Продолжить;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.НомерСерии) Или Не ЗначениеЗаполнено(Выборка.ГоденДо) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"Колонка",
				"Корректность",
				НСтр("ru = 'Номер серии'"),
				Выборка.НомерСтроки, НСтр("ru = 'Товары'"),
				НСтр("ru = 'Для генерации серии нужно запросить информацио об упаковках.'"));
			ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Результат.Ошибка,
				ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Объект.Товары", Выборка.НомерСтроки, "НомерСерии"),
				ТекстСообщения,
				Неопределено);
			Продолжить;
		КонецЕсли;
		
		СтрокаТовары = ТабличнаяЧасть.Получить(Выборка.НомерСтроки - 1);
		
		Если ЗначениеЗаполнено(Выборка.Серия) Тогда
			СтрокаТовары.Серия = Выборка.Серия;
			Результат.ЕстьЗаполненныеСтроки = Истина;
		Иначе
			ПараметрыПоиска = Новый Структура;
			ПараметрыПоиска.Вставить("Владелец", Выборка.Номенклатура);
			ПараметрыПоиска.Вставить("НомерСерии", Выборка.НомерСерии);
			ПараметрыПоиска.Вставить("ГоденДо", Выборка.ГоденДо);
			НайденныеСтроки = ТаблицаНовыхСерий.НайтиСтроки(ПараметрыПоиска);
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаТовары.Серия = НайденныеСтроки[0].Серия;
				Результат.ЕстьЗаполненныеСтроки = Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	// Конец _Демо
	
КонецПроцедуры

// Проверяет использование нескольких организаций в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Несколько организаций используются.
//
Функция ИспользоватьНесколькоОрганизаций() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Проверяет использование мест деятельности организаций в информационной базе.
// 
// Возвращаемое значение:
//  Булево - места деятельности используются.
//
Функция ИспользоватьМестаДеятельности() Экспорт
	
	// _Демо
	Возврат Истина;
	// Конец _Демо
	Возврат Ложь;
	
КонецФункции

// Проверяет использование мест деятельности контрагентов в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Места деятельности используются.
//
Функция ИспользоватьМестаДеятельностиКонтрагентов() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Проверяет использование характеристик номенклатуры в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Характеристики используются.
//
Функция ИспользоватьХарактеристикиНоменклатуры() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Проверяет использование серий номенклатуры в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Серии используются.
//
Функция ИспользоватьСерииНоменклатуры() Экспорт
	
	// _Демо
	//Возврат Истина;
	// Конец _Демо
	Возврат Ложь;
	
КонецФункции

// Проверяет использование упаковок номенклатуры в информационной базе.
// 
// Возвращаемое значение:
//  Булево - Упаковки используются.
//
Функция ИспользоватьУпаковкиНоменклатуры() Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Позволяет определить получение валюты регламентированного учета.
//
// Возвращаемое значение:
//  СправочникСсылка.Валюты - Валюта регламентированного учета.
//
Функция ВалютаРегламентированногоУчета() Экспорт
	
	Возврат "RUR";
	
КонецФункции

// Возвращает структуру, содержащую Страну, Регистрационный номер, наименование, признак физического лица, ИНН и КПП.
//
// Параметры:
//  Контрагент - ОпределяемыйТип.КонтрагентГИСМ - Контрагент.
//
// Возвращаемое значение:
//   Структура - со свойствами:
//     Страна  - Строка - Страна регистрации контрагента.
//     РегистрационныйНомер  - Строка - Регистрационный номер контрагента.
//     Наименование  - Строка - Наименование контрагента.
//     НаименованиеПолное  - Строка - Полное наименование контрагента.
//     ЭтоФизическоеЛицо  - Булево - Признак физического лица.
//     ИНН  - Строка - ИНН контрагента.
//     КПП  - Строка - КПП контрагента.
//     ЮридическийАдрес - Строка - Юридический адрес контрагента.
//
Функция РеквизитыКонтрагента(Контрагент) Экспорт
	
	Реквизиты = Новый Структура("Страна, РегистрационныйНомер, Наименование, НаименованиеПолное, ЭтоФизическоеЛицо, ИТИН, ИНН, КПП, ЮридическийАдрес");
	// _Демо
	ЗаполнитьЗначенияСвойств(Реквизиты, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Контрагент, "ЭтоФизическоеЛицо, ИНН, КПП"));
	// Конец _Демо
	Возврат Реквизиты;
	
КонецФункции

// В функции нужно определить описание типов объектов прикладного решения.
// На пример:
//	ТипОрганизация = Новый ОписаниеТипов("СправочникСсылка.Организации");
//	Типы = Новый Массив;
//	Типы.Добавить(Тип("СправочникСсылка.Склады"));
//	Типы.Добавить(Тип("СправочникСсылка.СтруктураПредприятия"));
//	ТипОбъектМестаДеятельностиОрганизации = Новый ОписаниеТипов(Типы);
//	ТипКонтрагент = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
//
// Параметры:
//  ТипОрганизация - ОписаниеТипов - описание типа для собственной организации,
//  ТипОбъектМестаДеятельностиОрганизации - ОписаниеТипа - описание типа для собственного объекта места деятельности,
//  ТипКонтрагент - ОписаниеТипа - описание типа для сторонней организации,
//  ТипОбъектМестаДеятельностиКонтрагента - ОписаниеТипа - описание типа для стороннего объекта места деятельности.
//
//
Процедура ОписаниеТиповОрганизацииКонтрагентаОбъектаМестаДеятельности(
		ТипОрганизация = Неопределено,
		ТипОбъектМестаДеятельностиОрганизации = Неопределено,
		ТипКонтрагент = Неопределено,
		ТипОбъектМестаДеятельностиКонтрагента = Неопределено) Экспорт
	
	// _Демо
	ТипОрганизация = Новый ОписаниеТипов("СправочникСсылка.Организации");
	ТипОбъектМестаДеятельностиОрганизации = Новый ОписаниеТипов("СправочникСсылка.Склады");
	ТипКонтрагент = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	// Конец _Демо
	
КонецПроцедуры

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме.
//
// Параметры:
//  Форма - УправляемаяФорма - форма, в которой необходимо настроить подключаемое оборудование,
//  ПрефиксыЭлементовФормы - Строка - строка имен табличных частей, разделенных запятыми, 
//  В которых нужно настроить видимость команд.
//
Процедура НастроитьПодключаемоеОборудование(Форма, ПрефиксыЭлементовФормы = "Товары") Экспорт
	
	// _Демо
	Форма.ИспользоватьПодключаемоеОборудование = Истина;
	// Конец _Демо
	
КонецПроцедуры

// Получить количество возможных документов поступления товаров для сопоставления.
//
// Параметры:
//  Объект - ДокументОбъект.Уведомление - документ для которого подбираются поступления.
// 
// Возвращаемое значение:
//  Число - количество документов.
//
Функция ПолучитьКоличествоВозможныхОснованийДляУведомления(Объект) Экспорт
	
	КоличествоДокументов = 0;
	
	
	Возврат КоличествоДокументов;
	
КонецФункции

// Нужно реализовать проверку наличия расхождений между Уведомлением и Основанием.
//
// Параметры:
//  Уведомление - ДокументСсылка.Уведомление - проверяемое уведомление,
//  Основание - ДокументСсылка - проверяемое основание уведомления.
//
// Возвращаемое значение:
//  Булево - Истина, если есть расхождения, иначе - Ложь.
//
Функция ЕстьРасхожденияМеждуУведомлениемИОснованием(Уведомление, Основание) Экспорт
	
	Возврат Ложь;
	
КонецФункции

// Нужно заполнить список возможных уведомлений для связи с основанием.
//
// Параметры:
//  МетаданныеУведомления - ОбъектМетаданных - метаданные уведомления, возможные значения которого надо получить;
//  Основание - Ссылка - основание уведомления, для которого подбираются уведомления.
//
// Возвращаемое значение:
//  Массив - список подходящих уведомлений.
//
Функция ВозможныеУведомленияПоОснованию(МетаданныеУведомления, Основание) Экспорт
	
	ВозможныеУведомления = Новый Массив;
	
	
	Возврат ВозможныеУведомления;
	
КонецФункции

// Можно переопределить необходимость добавления команды создания уведомления для учетного документа.
//
// Возвращаемое значение:
//   Ложь - команда создания уведомления не будет добавлена
//
Функция НужноСоздатьУведомленияПоОснованию(МетаданныеУведомления, Основание) Экспорт
	
КонецФункции

#Область ОбработчикиСобытийДокументов

// Вызывается при вводе документа на основании, при выполнении метода Заполнить или при интерактивном вводе нового.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - заполняемый документ,
//  ДанныеЗаполнения - Произвольный - значение, которое используется как основание для заполнения,
//  ТекстЗаполнения - Строка, Неопределено - текст, используемый для заполнения документа,
//  СтандартнаяОбработка - Булево - признак выполнения стандартной (системной) обработки события.
//
Процедура ОбработкаЗаполнения(ДокументОбъект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) Экспорт
	
	// _Демо
	//Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП") Тогда
	//	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка._ДемоОтпускПоЛьготномуРецепту") Тогда
	//		Запрос = Новый Запрос("
	//		|ВЫБРАТЬ
	//		|	Документ.Ссылка                    КАК Основание,
	//		|	ОрганизацииМДЛП.Организация        КАК Организация,
	//		|	ОрганизацииМДЛП.МестоДеятельности  КАК МестоДеятельности,
	//		|	Документ.НомерЛьготногоРецепта     КАК НомерДокумента,
	//		|	Документ.ДатаЛьготногоРецепта      КАК ДатаДокумента,
	//		|	НЕ Документ.Проведен               КАК ЕстьОшибкиПроведен
	//		|ИЗ
	//		|	Документ._ДемоОтпускПоЛьготномуРецепту КАК Документ
	//		|	ЛЕВОЕ СОЕДИНЕНИЕ
	//		|		РегистрСведений.СубъектыОбращенияМДЛП КАК ОрганизацииМДЛП
	//		|	ПО
	//		|		ОрганизацииМДЛП.СобственнаяОрганизация
	//		|		И ОрганизацииМДЛП.ОрганизацияКонтрагент = Документ.Организация
	//		|		И ОрганизацииМДЛП.ОбъектМестаДеятельности = Документ.Склад
	//		|ГДЕ
	//		|	Документ.Ссылка = &ДокументОснование
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ТаблицаДокументы.Ссылка  КАК Ссылка
	//		|ПОМЕСТИТЬ ОформленныеДокументы
	//		|ИЗ
	//		|	Документ.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП КАК ТаблицаДокументы
	//		|ГДЕ
	//		|	ТаблицаДокументы.Основание = &ДокументОснование
	//		|	И НЕ ТаблицаДокументы.ПометкаУдаления
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	НомераУпаковок.Номенклатура.GTIN + НомераУпаковок.НомерУпаковки      КАК НомерКиЗ,
	//		|	ВЫБОР КОГДА НомераУпаковок.ДоляУпаковки = 0 ТОГДА 1 ИНАЧЕ НомераУпаковок.ДоляУпаковки КОНЕЦ  КАК Количество
	//		|ПОМЕСТИТЬ КОформлению
	//		|ИЗ
	//		|	Документ._ДемоОтпускПоЛьготномуРецепту.Товары КАК НомераУпаковок
	//		|ГДЕ
	//		|	НомераУпаковок.Ссылка = &ДокументОснование
	//		|
	//		|ОБЪЕДИНИТЬ ВСЕ
	//		|
	//		|ВЫБРАТЬ
	//		|	ОформленныеТовары.НомерКиЗ  КАК НомерКиЗ,
	//		|	-(ВЫБОР КОГДА ОформленныеТовары.ДоляОтВторичнойУпаковки = 0 ТОГДА 1 ИНАЧЕ ОформленныеТовары.ДоляОтВторичнойУпаковки КОНЕЦ)  КАК Количество
	//		|ИЗ
	//		|	Документ.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП.НомераУпаковок  КАК ОформленныеТовары
	//		|ГДЕ
	//		|	ОформленныеТовары.Ссылка В (ВЫБРАТЬ Т.Ссылка ИЗ ОформленныеДокументы КАК Т)
	//		|	И НЕ ОформленныеТовары.Отклонено
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	НомераУпаковок.НомерКиЗ   КАК НомерКиЗ,
	//		|	Товары.Номенклатура       КАК Номенклатура,
	//		|	Товары.Номенклатура.GTIN  КАК GTIN,
	//		|	ВЫБОР
	//		|		КОГДА СУММА(НомераУпаковок.Количество) = 1
	//		|			ТОГДА 0
	//		|		ИНАЧЕ СУММА(НомераУпаковок.Количество)
	//		|	КОНЕЦ КАК ДоляОтВторичнойУпаковки
	//		|ИЗ
	//		|	КОформлению КАК НомераУпаковок
	//		|	ЛЕВОЕ СОЕДИНЕНИЕ
	//		|		Документ._ДемоОтпускПоЛьготномуРецепту.Товары  КАК Товары
	//		|	ПО
	//		|		Товары.Ссылка = &ДокументОснование
	//		|		И Товары.Номенклатура.GTIN + Товары.НомерУпаковки = НомераУпаковок.НомерКиЗ
	//		|СГРУППИРОВАТЬ ПО
	//		|	Номенклатура,
	//		|	НомерКиЗ
	//		|ИМЕЮЩИЕ
	//		|	СУММА(НомераУпаковок.Количество) > 0
	//		|");
	//		
	//		Запрос.УстановитьПараметр("ДокументОснование", ДанныеЗаполнения);
	//		РезультатЗапроса = Запрос.ВыполнитьПакет();
	//		
	//		Шапка = РезультатЗапроса[0].Выбрать();
	//		Шапка.Следующий();
	//		
	//		Если Шапка.ЕстьОшибкиПроведен Тогда
	//			ВызватьИсключение НСтр("ru = 'Документ не проведен'");
	//		КонецЕсли;
	//		
	//		Товары = РезультатЗапроса[РезультатЗапроса.ВГраница()].Выгрузить();
	//		Если Товары.Количество() = 0 Тогда
	//			ВызватьИсключение НСтр("ru = 'Нет данных для заполнения'");
	//		КонецЕсли;
	//		
	//		ЗаполнитьЗначенияСвойств(ДокументОбъект, Шапка);
	//		
	//		ДокументОбъект.Товары.Очистить();
	//		ДокументОбъект.НомераУпаковок.Очистить();
	//		
	//		Для Каждого Строка Из Товары Цикл
	//			
	//			Отбор = Новый Структура("Номенклатура", Строка.Номенклатура);
	//			НайденныеСтроки = ДокументОбъект.Товары.НайтиСтроки(Отбор);
	//			Если НайденныеСтроки.Количество() = 0 Тогда
	//				СтрокаТовара = ДокументОбъект.Товары.Добавить();
	//				ЗаполнитьЗначенияСвойств(СтрокаТовара, Строка);
	//				СтрокаТовара.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	//			Иначе
	//				СтрокаТовара = НайденныеСтроки[0];
	//			КонецЕсли;
	//			
	//			СтрокаУпаковки = ДокументОбъект.НомераУпаковок.Добавить();
	//			СтрокаУпаковки.НомерКиЗ = Строка.НомерКиЗ;
	//			СтрокаУпаковки.ИдентификаторСтроки = СтрокаТовара.ИдентификаторСтроки;
	//			СтрокаУпаковки.ДоляОтВторичнойУпаковки = Строка.ДоляОтВторичнойУпаковки;
	//			СтрокаТовара.Количество = СтрокаТовара.Количество + ?(Строка.ДоляОтВторичнойУпаковки > 0, Строка.ДоляОтВторичнойУпаковки, 1);
	//			СтрокаТовара.КоличествоУпаковок = СтрокаТовара.Количество;
	//			
	//		КонецЦикла;
	//	КонецЕсли;
	//КонецЕсли;
	//// Конец _Демо
	//
КонецПроцедуры

// Вызывается расширением формы при необходимости проверки заполнения 
// Реквизитов при записи или при проведении документа в форме,
// а также при выполнении метода ПроверитьЗаполнение.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - проверяемый документ,
//  Отказ - Булево - признак отказа от проведения документа,
//  ПроверяемыеРеквизиты - Массив - массив путей к реквизитам, для которых будет выполнена проверка заполнения,
//  НепроверяемыеРеквизиты - Массив - массив путей к реквизитам, для которых не будет выполнена проверка заполнения.
//
Процедура ОбработкаПроверкиЗаполнения(ДокументОбъект, Отказ, ПроверяемыеРеквизиты, НепроверяемыеРеквизиты) Экспорт
	
	
	
КонецПроцедуры

// Возникает перед выполнением записи документа. Вызывается после начала транзакции записи, но до начала записи документа.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект - записываемый документ,
//  Отказ - Булево - признак отказа от записи,
//  РежимЗаписи - РежимЗаписиДокумента - текущий режим записи документа,
//  РежимПроведения - РежимПроведенияДокумента - текущий режим проведения документа.
//
Процедура ПередЗаписью(ДокументОбъект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область Статусы

// Процедура вызывается при изменении статуса обработки документа.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - ссылка на документ,
//  ПредыдущийСтатус - ПеречислениеСсылка.СтатусыОбработки* - предыдущий статус обработки,
//  НовыйСтатус - ПеречислениеСсылка.СтатусыОбработки* - новый статус обработки.
//
Процедура ПриИзмененииСтатусаДокумента(ДокументСсылка, ПредыдущийСтатус, НовыйСтатус) Экспорт
	
	
	
КонецПроцедуры

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОЗавершенииЭтапаОкончательнойУпаковки(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОЗавершенииЭтапаОкончательнойУпаковки(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтбореОбразцов(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтбореОбразцов(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВыпускеГотовойПродукции(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВыпускеГотовойПродукции(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОРозничныхПродажах(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОРозничныхПродажах(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПриемке(ДокументОснование) Экспорт
	
	// _Демо
	ЗапрашиваемыеРеквизиты = Новый Структура;
	ЗапрашиваемыеРеквизиты.Вставить("Проведен");
	ЗапрашиваемыеРеквизиты.Вставить("Дата");
	ЗапрашиваемыеРеквизиты.Вставить("Номер");
	ЗапрашиваемыеРеквизиты.Вставить("АвторДокумента");
	ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "Склад");
	//ЗапрашиваемыеРеквизиты.Вставить("Организация");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
	
	ЗначенияРеквизитов.Вставить("Организация", ДокументОснование.СтруктурнаяЕдиница.Организация);

	ИнтеграцияМДЛП.РассчитатьСтатусОформления(
		Метаданные.Документы.УведомлениеОПриемкеМДЛП,
		ДокументОснование,
		ЗначенияРеквизитов,
		Истина);
	// Конец _Демо
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПриемке(ДокументОснование) Экспорт
	
// _Демо
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка  КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОформленныеТовары.Номенклатура  КАК Номенклатура,
	|	ОформленныеТовары.Серия         КАК Серия,
	|	0                               КАК План,
	|	ОформленныеТовары.Количество    КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
   	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.Товары КАК ОформленныеТовары
	|ГДЕ
	|	ОформленныеТовары.Ссылка В (ВЫБРАТЬ Т.Ссылка ИЗ ОформленныеДокументы КАК Т)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТовары.Номенклатура  КАК Номенклатура,
	|	ОформленныеТовары.Серия         КАК Серия,
	|	0                               КАК План,
	|	ОформленныеТовары.Количество    КАК Факт
	|ИЗ
	|	Документ.УведомлениеОПриемкеМДЛП.НомераУпаковок КАК УпаковкиТовара
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОПриемкеМДЛП.СоставТранспортныхУпаковок КАК ОформленныеТовары
	|	ПО
	|		ОформленныеТовары.Ссылка = УпаковкиТовара.Ссылка
	|		И ОформленныеТовары.ИдентификаторСтрокиУпаковки = УпаковкиТовара.ИдентификаторСтроки
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.УведомлениеОПриемкеМДЛП.ТранспортныеУпаковки КАК ОформленныеУпаковки
	|	ПО
	|		ОформленныеТовары.Ссылка = ОформленныеУпаковки.Ссылка
	|		И ОформленныеТовары.ИдентификаторСтроки = ОформленныеУпаковки.ИдентификаторСтроки
	|ГДЕ
	|	УпаковкиТовара.Ссылка В (ВЫБРАТЬ Т.Ссылка ИЗ ОформленныеДокументы КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.Номенклатура   КАК Номенклатура,
	|	ТоварыКОформлению.Серия          КАК Серия,
	|	СУММА(ТоварыКОформлению.План)    КАК План,
	|	СУММА(ТоварыКОформлению.Факт)    КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.Номенклатура,
	|	ТоварыКОформлению.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт > 0 И Т.План > 0)                КАК ЕстьОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт >= 0 И Т.План > Т.Факт)          КАК ЕстьНеОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План = Т.Факт)                        КАК ЕстьПолностьюОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План < Т.Факт)                        КАК ЕстьОшибкиОформления
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	// Конец _Демо   
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтгрузке(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтгрузке(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПеремещении(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПеремещенииГЛО(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПеремещении(ДокументОснование) Экспорт
	
КонецФункции

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПеремещенииГЛО(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбОтпускеПоЛьготномуРецепту(ДокументОснование) Экспорт
	
	// _Демо
	ЗапрашиваемыеРеквизиты = Новый Структура;
	ЗапрашиваемыеРеквизиты.Вставить("Проведен");
	ЗапрашиваемыеРеквизиты.Вставить("Дата");
	ЗапрашиваемыеРеквизиты.Вставить("Номер");
	ЗапрашиваемыеРеквизиты.Вставить("Ответственный");
	ЗапрашиваемыеРеквизиты.Вставить("МестоДеятельности", "Склад");
	ЗапрашиваемыеРеквизиты.Вставить("Организация");
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, ЗапрашиваемыеРеквизиты);
	
	ИнтеграцияМДЛП.РассчитатьСтатусОформления(
		Метаданные.Документы.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП,
		ДокументОснование,
		ЗначенияРеквизитов,
		Истина);
	// Конец _Демо
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбОтпускеПоЛьготномуРецепту(ДокументОснование) Экспорт
	
	// _Демо
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	ТаблицаДокументы.Ссылка  КАК Ссылка
	|ПОМЕСТИТЬ ОформленныеДокументы
	|ИЗ
	|	Документ.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП КАК ТаблицаДокументы
	|ГДЕ
	|	ТаблицаДокументы.Основание = &ДокументОснование
	|	И НЕ ТаблицаДокументы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НомераУпаковок.Номенклатура.GTIN + НомераУпаковок.НомерУпаковки  КАК НомерУпаковки,
	|	1                             КАК План,
	|	0                             КАК Факт
	|ПОМЕСТИТЬ ТоварыКОформлению
	|ИЗ
	|	Документ._ДемоОтпускПоЛьготномуРецепту.Товары КАК НомераУпаковок
	|ГДЕ
	|	НомераУпаковок.Ссылка = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОформленныеТовары.НомерКиЗ  КАК НомерУпаковки,
	|	0                           КАК План,
	|	1                           КАК Факт
	|ИЗ
	|	Документ.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП.НомераУпаковок КАК ОформленныеТовары
	|ГДЕ
	|	НЕ ОформленныеТовары.Отклонено
	|	И ОформленныеТовары.Ссылка В (ВЫБРАТЬ Т.Ссылка ИЗ ОформленныеДокументы КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКОформлению.НомерУпаковки  КАК НомерУпаковки,
	|	СУММА(ТоварыКОформлению.План)    КАК План,
	|	СУММА(ТоварыКОформлению.Факт)    КАК Факт
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	ТоварыКОформлению КАК ТоварыКОформлению
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлению.НомерУпаковки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт > 0 И Т.План > 0)                КАК ЕстьОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.Факт >= 0 И Т.План > Т.Факт)          КАК ЕстьНеОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План = Т.Факт)                        КАК ЕстьПолностьюОформленныеТовары,
	|	1 В (ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ Результат КАК Т ГДЕ Т.План < Т.Факт)                        КАК ЕстьОшибкиОформления
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Возврат Запрос;
	// Конец _Демо
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВыдачеВОтделения(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВыдачеВОтделения(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПередачеНаУничтожение(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПередачеНаУничтожение(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОФактеУничтожения(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОФактеУничтожения(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВыбытии(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВыбытии(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОПовторномВводеВОборот(ДокументОснование) Экспорт
	
	
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОПовторномВводеВОборот(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОбАгрегированииИТрансформацииУпаковок(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОбАгрегированииИТрансформацииУпаковок(ДокументОснование) Экспорт
	
КонецФункции

// Рассчитывает статус оформления документа учетной системы.
// См. ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// Параметры:
//  ДокументОснование - ДокументСсылка - Основание уведомления.
//
Процедура РассчитатьСтатусОформленияУведомленияОВводеВОборот(ДокументОснование) Экспорт
	
КонецПроцедуры

// Возвращает запрос для расчета статуса оформления. Используется при вызове ИнтеграцияМДЛП.РассчитатьСтатусОформления.
//
// ВозвращаемоеЗначение:
//  Запрос - Выборка из результата запроса должна содержать одну строку с полями:
//    * ЕстьОформленныеТовары - Булево
//    * ЕстьНеОформленныеТовары - Булево
//    * ЕстьПолностьюОформленныеТовары - Булево
//    * ЕстьОшибкиОформления - Булево
//
Функция ЗапросСтатусаОформленияУведомленияОВводеВОборот(ДокументОснование) Экспорт
	
КонецФункции

#КонецОбласти

#Область ПанельМаркировкиМДЛП

// Позволяет переопределить стандартный механизм заполнения документов, выводимых в панели маркировки.
//
// Параметры:
//  ТаблицаДокументы     - ТаблицаЗначений - 
//  СтандартнаяОбработка - Булево - если установить Ложь, то стандартное заполнение пропускается.
//
Процедура ПередЗаполнениемДокументовПанелиМаркировкиМДЛП(ТаблицаДокументы, СтандартнаяОбработка) Экспорт
	
	
	
КонецПроцедуры

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОЗавершенииЭтапаОкончательнойУпаковкиТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтбореОбразцовТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВыпускеГотовойПродукцииТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтгрузкеТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПриемкеТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОРозничныхПродажахТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПеремещенииТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПеремещенииГЛОТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбОтпускеПоЛьготномуРецептуТекстЗапросаОформите() Экспорт
	
	// _Демо
	//ТекстЗапроса = "
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ СтатусыОформления.Основание) КАК КоличествоДокументов
	//|ИЗ
	//|	РегистрСведений.СтатусыОформленияДокументовМДЛП КАК СтатусыОформления
	//|	ЛЕВОЕ СОЕДИНЕНИЕ
	//|		Документ._ДемоОтпускПоЛьготномуРецепту КАК _ДемоОтпускПоЛьготномуРецепту
	//|	ПО
	//|		_ДемоОтпускПоЛьготномуРецепту.Ссылка = СтатусыОформления.Основание
	//|	ЛЕВОЕ СОЕДИНЕНИЕ
	//|		РегистрСведений.СубъектыОбращенияМДЛП КАК ОрганизацииМДЛП
	//|	ПО
	//|		ОрганизацииМДЛП.ОрганизацияКонтрагент = _ДемоОтпускПоЛьготномуРецепту.Организация
	//|		И ОрганизацииМДЛП.ОбъектМестаДеятельности = _ДемоОтпускПоЛьготномуРецепту.Склад
	//|ГДЕ
	//|	СтатусыОформления.Документ = ЗНАЧЕНИЕ(Документ.УведомлениеОбОтпускеПоЛьготномуРецептуМДЛП.ПустаяСсылка)
	//|	И СтатусыОформления.СтатусОформления В (
	//|		ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.НеОформлено),
	//|		ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовМДЛП.ОформленоЧастично)
	//|	)
	//|	И (&Организация = НЕОПРЕДЕЛЕНО ИЛИ ОрганизацииМДЛП.Организация = &Организация)
	//|	И (&МестоДеятельности = НЕОПРЕДЕЛЕНО ИЛИ ОрганизацииМДЛП.МестоДеятельности = &МестоДеятельности)
	//|";
	//Возврат ТекстЗапроса;
	// Конец _Демо
	
	Возврат "";
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВыдачеВОтделенияТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПередачеНаУничтожениеТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОФактеУничтоженияТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВыбытииТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОПовторномВводеВОборотТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОбАгрегированииИТрансформацииУпаковокТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

// Возвращает текст запроса, подсчитывающий количество документов требующих оформления.
// Выборка результата запроса должна содержать поле "КоличествоДокументов".
//
// Возвращаемое значение:
//  Строка - Текст запроса.
//
Функция УведомлениеОВводеВОборотТекстЗапросаОформите() Экспорт
	
	
	
КонецФункции

#КонецОбласти

#Область УстаревшиеПроцедурыИФункции

// Устарела. Следует использовать ОписаниеТиповОрганизацииКонтрагентаОбъектаМестаДеятельности.
//
// В функции нужно определить значения по умолчанию, которые будут подставляться в
// реквизиты не сопоставленных элементов справочника.
//
// Параметры:
//  Организация - ОпределяемыйТип.ОрганизацияКонтрагентМДЛП - значение по умолчанию для собственной организации,
//  МестоДеятельности - ОпределяемыйТип.ОбъектМестаДеятельностиМДЛП - значение 
//  По умолчанию для собственного объекта места деятельности,
//  Контрагент - ОпределяемыйТип.ОрганизацияКонтрагентМДЛП - значение по умолчанию для сторонней организации,
//  МестоДеятельностиКонтрагента - ОпределяемыйТип.ОбъектМестаДеятельностиМДЛП - значение 
//  По умолчанию для стороннего объекта места деятельности.
//
Процедура ЗначенияПоУмолчаниюНеСопоставленныхОбъектов(
		Организация = Неопределено,
		МестоДеятельности = Неопределено,
		Контрагент = Неопределено,
		МестоДеятельностиКонтрагента = Неопределено) Экспорт
	
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
